tap "homebrew/bundle"
tap "mtgto/macskk"
brew "cmake"
brew "flac"
brew "ffmpeg"
brew "git"
brew "gnupg"
brew "node"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "rclone"
brew "rust"
brew "sevenzip"
brew "swaks"
brew "tmux"
brew "wget"
brew "yarn"
brew "zsh-completions"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "discord"
cask "dropbox"
cask "firefox@developer-edition"
cask "font-udev-gothic"
cask "font-udev-gothic-hs"
cask "font-udev-gothic-nf"
cask "foobar2000"
cask "ghostty"
cask "gitkraken"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "keybase"
cask "obs"
cask "obsidian"
cask "proton-drive"
cask "proton-mail"
cask "tailscale-app"
cask "raycast"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
vscode "be5invis.toml"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jetbrains.jetbrains-ai-assistant"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "nuxtr.nuxtr-vscode"
vscode "openai.openai-chatgpt-adhoc"
vscode "ritwickdey.liveserver"
vscode "sumneko.lua"
vscode "vue.volar"
vscode "yzane.markdown-pdf"
