tap "homebrew/bundle"
tap "lizardbyte/homebrew"
tap "mtgto/macskk"
# Cross-platform make
brew "cmake"
# Free lossless audio codec
brew "flac"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Mac App Store command-line interface
brew "mas"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Rsync for cloud storage
brew "rclone"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SMTP command-line test tool
brew "swaks"
# Terminal multiplexer
brew "tmux"
# Terminal UI OS (Terminal Multiplexer)
brew "tuios"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Additional completion definitions for zsh
brew "zsh-completions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Image editing and design software
cask "affinity"
# GPU-accelerated terminal emulator
cask "alacritty"
# AI Coding Agent IDE
cask "antigravity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Node-based image, video and audio generator
cask "comfyui"
# Voice and text chat software
cask "discord"
# Security including web and email protection
cask "eset-cyber-security"
# Web browser
cask "firefox@developer-edition"
cask "font-udev-gothic"
cask "font-udev-gothic-hs"
cask "font-udev-gothic-nf"
# Audio player
cask "foobar2000"
# Audio converter and CD ripper
cask "freac"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# JetBrains tools manager
cask "jetbrains-toolbox"
# GameStream client
cask "moonlight"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Customise mouse buttons, wheels and cursor speed
cask "steermouse"
# Spreadsheet style tag editor for audio files
cask "tageditor"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "BetterSnapTool", id: 417375580
mas "Display Menu", id: 549083868
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Tag Editor 2", id: 984278082
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Yoink", id: 457622435
vscode "be5invis.toml"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jetbrains.jetbrains-ai-assistant"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "nuxtr.nuxtr-vscode"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "ritwickdey.liveserver"
vscode "sumneko.lua"
vscode "vue.volar"
vscode "yzane.markdown-pdf"
