tap "homebrew/bundle"
tap "mtgto/macskk"
brew "cmake"
brew "flac"
brew "ffmpeg"
brew "git"
brew "gnupg"
brew "node"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "rclone"
brew "rust"
brew "sevenzip"
brew "swaks"
brew "tmux"
brew "wget"
brew "zsh-completions"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "discord"
cask "dropbox"
cask "firefox@developer-edition"
cask "font-udev-gothic"
cask "font-udev-gothic-hs"
cask "font-udev-gothic-nf"
cask "foobar2000"
cask "ghostty"
cask "gitkraken"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "keybase"
cask "notion"
cask "obs"
cask "obsidian"
cask "proton-drive"
cask "proton-mail"
cask "tailscale-app"
cask "visual-studio-code"
cask "vlc"
