tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "microsoft/git"
brew "python@3.9"
brew "awscli"
brew "direnv"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "git-secrets"
brew "gnupg"
brew "gotop"
brew "node"
brew "hexo"
brew "httpie"
brew "hugo"
brew "jq"
brew "n"
brew "neofetch"
brew "netlify-cli"
brew "pinentry-mac"
brew "stow"
brew "tldr"
brew "tmux"
brew "yarn"
cask "alacritty"
cask "font-noto-sans-cjk-jp"
cask "git-credential-manager-core"
cask "gitkraken"
cask "visual-studio-code"
