tap "1password/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "romkatv/powerlevel10k"
tap "yt-dlp/taps"
brew "awscli"
brew "direnv"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "git-secrets"
brew "gnupg"
brew "gotop"
brew "node"
brew "hexo"
brew "httpie"
brew "hugo"
brew "python@3.9"
brew "jq"
brew "n"
brew "neofetch"
brew "netlify-cli"
brew "pinentry-mac"
brew "stow"
brew "tldr"
brew "tmux"
brew "yarn"
brew "zsh-completions"
brew "jesseduffield/lazygit/lazygit"
cask "1password-cli"
cask "alacritty"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-noto-sans-cjk-jp"
cask "gitkraken"
cask "iterm2"
cask "kitty"
cask "nheko"
cask "thedesk"
cask "unofficial-wineskin"
cask "visual-studio-code"
cask "whalebird"
