tap "1password/tap"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "romkatv/powerlevel10k"
tap "yt-dlp/taps"
brew "awscli"
brew "direnv"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "git-secrets"
brew "gnupg"
brew "gotop"
brew "node"
brew "hexo"
brew "httpie"
brew "hugo"
brew "python@3.9"
brew "jq"
brew "n"
brew "neofetch"
brew "netlify-cli"
brew "pinentry-mac"
brew "stow"
brew "telnet"
brew "tldr"
brew "tmux"
brew "yarn"
brew "zsh-completions"
brew "jesseduffield/lazygit/lazygit"
brew "mas"

cask "firefox-developer-edition"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-noto-sans-cjk-jp"
cask "font-udev-gothic"
cask "font-udev-gothic-nf"
cask "git-credential-manager-core"
cask "gitkraken"
cask "visual-studio-code"
cask "raycast"
cask "warp"

mas "NextDNS", id:1464122853
mas "RunCat", id:1429033973
mas "BetterSnapTool", id:417375580
mas "Display Menu", id:549083868
